Revit 2027 API
IntersectingElementData.IntersectingElementId Property
 Id of the intersecting element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId IntersectingElementId { get; }
Public ReadOnly Property IntersectingElementId As ElementId
	Get
public:
property ElementId^ IntersectingElementId {
	ElementId^ get ();
}
member IntersectingElementId : ElementId with get
Property Value
ElementId
See Also
Reference
IntersectingElementData Class
Autodesk.Revit.DB Namespace